asset_packager/blog-step4/app/controllers/posts_controller.rb

INSERT INTO "posts" ("updated_at", "title", "body", "created_at") VALUES('2009-09-06 21:29:16', 'Lorem ipsum dolor sit amet', 'Lorem ipsum dolor sit amet, consectetur adipiscing elit. Sed dignissim aliquet eros, nec porttitor dui laoreet eu.
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save